davecheney/avr11/cpu.cpp
#include <SdFat.h>
#include "avr11.h"
#include "mmu.h"
#include "cons.h"
#include "unibus.h"
#include "cpu.h"

#include "bootrom.h"
#include "rk05.h"

pdp11::intr itab[ITABN];

namespace cpu {

// signed integer registers
int32_t R[8];

uint16_t	PS; // processor status
uint16_t	PC; // address of current instruction
uint16_t   KSP, USP; // kernel and user stack pointer
uint16_t LKS;
bool curuser, prevuser;

void reset(void) {
  LKS = 1 << 7;
  uint16_t i;
  for (i = 0; i < 29; i++) {
    unibus::write16(02000 + (i * 2), bootrom[i]);
  }
  R[7] = 002002;
  cons::clearterminal();
  rk11::reset();
}

static uint16_t read8(const uint16_t a) {
  return unibus::read8(mmu::decode(a, false, curuser));
}

static uint16_t read16(const uint16_t a) {
  return unibus::read16(mmu::decode(a, false, curuser));
}

static void write8(const uint16_t a, const uint16_t v) {
  unibus::write8(mmu::decode(a, true, curuser), v);
}

static void write16(const uint16_t a, const uint16_t v) {
  unibus::write16(mmu::decode(a, true, curuser), v);
}

static bool isReg(const uint16_t a) {
  return (a & 0177770) == 0170000;
}

static uint16_t memread16(const uint16_t a) {
  if (isReg(a)) {
    return R[a & 7];
  }
  return read16(a);
}

static uint16_t memread(uint16_t a, uint8_t l) {
  if (isReg(a)) {
    const uint8_t r = a & 7;
    if (l == 2) {
      return R[r];
    }
    else {
      return R[r] & 0xFF;
    }
  }
  if (l == 2) {
    return read16(a);
  }
  return read8(a);
}

static void memwrite16(const uint16_t a, const uint16_t v) {
  if (isReg(a)) {
    R[a & 7] = v;
  } else {
    write16(a, v);
  }
}

static void memwrite(const uint16_t a, const uint8_t l, const uint16_t v) {
  if (isReg(a)) {
    const uint8_t r = a & 7;
    if (l == 2) {
      R[r] = v;
    }
    else {
      R[r] &= 0xFF00;
      R[r] |= v;
    }
    return;
  }
  if (l == 2) {
    write16(a, v);
  }
  else {
    write8(a, v);
  }
}

static uint16_t fetch16() {
  const uint16_t val = read16(R[7]);
  R[7] += 2;
  return val;
}

static void push(const uint16_t v) {
  R[6] -= 2;
  write16(R[6], v);
}

static uint16_t pop() {
  const uint16_t val = read16(R[6]);
  R[6] += 2;
  return val;
}

// aget resolves the operand to a vaddress.
// if the operand is a register, an address in
// the range [0170000,0170007). This address range is
// technically a valid IO page, but unibus doesn't map
// any addresses here, so we can safely do this.
static uint16_t aget(uint8_t v, uint8_t l) {
  if ((v & 070) == 000) {
    return 0170000 | (v & 7);
  }
  if (((v & 7) >= 6) || (v & 010)) {
    l = 2;
  }
  uint16_t addr = 0;
  switch (v & 060) {
    case 000:
      v &= 7;
      addr = R[v & 7];
      break;
    case 020:
      addr = R[v & 7];
      R[v & 7] += l;
      break;
    case 040:
      R[v & 7] -= l;
      addr = R[v & 7];
      break;
    case 060:
      addr = fetch16();
      addr += R[v & 7];
      break;
  }
  if (v & 010) {
    addr = read16(addr);
  }
  return addr;
}

static void branch(int16_t o) {
  if (o & 0x80) {
    o = -(((~o) + 1) & 0xFF);
  }
  o <<= 1;
  R[7] += o;
}

void switchmode(const bool newm) {
  prevuser = curuser;
  curuser = newm;
  if (prevuser) {
    USP = R[6];
  }
  else {
    KSP = R[6];
  }
  if (curuser) {
    R[6] = USP;
  }
  else {
    R[6] = KSP;
  }
  PS &= 0007777;
  if (curuser) {
    PS |= (1 << 15) | (1 << 14);
  }
  if (prevuser) {
    PS |= (1 << 13) | (1 << 12);
  }
}

static void setZ(bool b) {
   if (b) 
     PS |= FLAGZ;
}

static void MOV(const uint16_t instr) {
  const uint8_t d = instr & 077;
  const uint8_t s = (instr & 07700) >> 6;
  uint8_t l = 2 - (instr >> 15);
  const uint16_t msb = l == 2 ? 0x8000 : 0x80;
  uint16_t uval = memread(aget(s, l), l);
  const uint16_t da = aget(d, l);
  PS &= 0xFFF1;
  if (uval & msb) {
    PS |= FLAGN;
  }
  setZ(uval == 0);
  if ((isReg(da)) && (l == 1)) {
    l = 2;
    if (uval & msb) {
      uval |= 0xFF00;
    }
  }
  memwrite(da, l, uval);
}

static void CMP(uint16_t instr) {
  const uint8_t d = instr & 077;
  const uint8_t s = (instr & 07700) >> 6;
  const uint8_t l = 2 - (instr >> 15);
  const uint16_t msb = l == 2 ? 0x8000 : 0x80;
  const uint16_t max = l == 2 ? 0xFFFF : 0xff;
  uint16_t val1 = memread(aget(s, l), l);
  const uint16_t da = aget(d, l);
  uint16_t val2 = memread(da, l);
  const int32_t sval = (val1 - val2) & max;
  PS &= 0xFFF0;
  setZ(sval == 0);
  if (sval & msb) {
    PS |= FLAGN;
  }
  if (((val1 ^ val2)&msb) && (!((val2 ^ sval)&msb))) {
    PS |= FLAGV;
  }
  if (val1 < val2) {
    PS |= FLAGC;
  }
}

static void BIT(uint16_t instr) {
  const uint8_t d = instr & 077;
  const uint8_t s = (instr & 07700) >> 6;
  const uint8_t l = 2 - (instr >> 15);
  const uint16_t msb = l == 2 ? 0x8000 : 0x80;
  const uint16_t val1 = memread(aget(s, l), l);
  const uint16_t da = aget(d, l);
  const uint16_t val2 = memread(da, l);
  const uint16_t uval = val1 & val2;
  PS &= 0xFFF1;
  setZ(uval == 0);
  if (uval & msb) {
    PS |= FLAGN;
  }
}

static void BIC(uint16_t instr) {
  const uint8_t d = instr & 077;
  const uint8_t s = (instr & 07700) >> 6;
  const uint8_t l = 2 - (instr >> 15);
  const uint16_t msb = l == 2 ? 0x8000 : 0x80;
  const uint16_t max = l == 2 ? 0xFFFF : 0xff;
  const uint16_t val1 = memread(aget(s, l), l);
  const uint16_t da = aget(d, l);
  const uint16_t val2 = memread(da, l);
  const uint16_t uval = (max ^ val1) & val2;
  PS &= 0xFFF1;
  setZ(uval == 0);
  if (uval & msb) {
    PS |= FLAGN;
  }
  memwrite(da, l, uval);
}

static void BIS(uint16_t instr) {
  uint8_t d = instr & 077;
  uint8_t s = (instr & 07700) >> 6;
  uint8_t l = 2 - (instr >> 15);
  uint16_t msb = l == 2 ? 0x8000 : 0x80;
  uint16_t val1 = memread(aget(s, l), l);
  uint16_t da = aget(d, l);
  uint16_t val2 = memread(da, l);
  uint16_t uval = val1 | val2;
  PS &= 0xFFF1;
  setZ(uval == 0);
  if (uval & msb) {
    PS |= FLAGN;
  }
  memwrite(da, l, uval);
}

static void ADD(uint16_t instr) {
  uint8_t d = instr & 077;
  uint8_t s = (instr & 07700) >> 6;
  uint16_t val1 = memread16(aget(s, 2));
  uint16_t da = aget(d, 2);
  uint16_t val2 = memread16(da);
  uint16_t uval = (val1 + val2) & 0xFFFF;
  PS &= 0xFFF0;
  setZ(uval == 0);
  if (uval & 0x8000) {
    PS |= FLAGN;
  }
  if (!((val1 ^ val2) & 0x8000) && ((val2 ^ uval) & 0x8000)) {
    PS |= FLAGV;
  }
  if ((val1 + val2) >= 0xFFFF) {
    PS |= FLAGC;
  }
  memwrite16(da, uval);
}

static void SUB(uint16_t instr) {
  uint8_t d = instr & 077;
  uint8_t s = (instr & 07700) >> 6;
  uint16_t val1 = memread16(aget(s, 2));
  uint16_t da = aget(d, 2);
  uint16_t val2 = memread16(da);
  uint16_t uval = (val2 - val1) & 0xFFFF;
  PS &= 0xFFF0;
  setZ(uval == 0);
  if (uval & 0x8000) {
    PS |= FLAGN;
  }
  if (((val1 ^ val2) & 0x8000) && (!((val2 ^ uval) & 0x8000))) {
    PS |= FLAGV;
  }
  if (val1 > val2) {
    PS |= FLAGC;
  }
  memwrite16(da, uval);
}

