davecheney/avr11/cpu.cpp
static void JSR(uint16_t instr) {
  uint8_t d = instr & 077;
  uint8_t s = (instr & 07700) >> 6;
  uint8_t l = 2 - (instr >> 15);
  uint16_t uval = aget(d, l);
  if (isReg(uval)) {
    Serial.println(F("JSR called on register"));
    panic();
  }
  push(R[s & 7]);
  R[s & 7] = R[7];
  R[7] = uval;
}

static void MUL(const uint16_t instr) {
  uint8_t d = instr & 077;
  uint8_t s = (instr & 07700) >> 6;
  int32_t val1 = R[s & 7];
  if (val1 & 0x8000) {
    val1 = -((0xFFFF ^ val1) + 1);
  }
  uint8_t l = 2 - (instr >> 15);
  uint16_t da = aget(d, l);
  int32_t val2 = memread16(da);
  if (val2 & 0x8000) {
    val2 = -((0xFFFF ^ val2) + 1);
  }
  int32_t sval = val1 * val2;
  R[s & 7] = sval >> 16;
  R[(s & 7) | 1] = sval & 0xFFFF;
  PS &= 0xFFF0;
  if (sval & 0x80000000) {
    PS |= FLAGN;
  }
  setZ((sval & 0xFFFFFFFF) == 0);
  if ((sval < (1 << 15)) || (sval >= ((1 << 15) - 1))) {
    PS |= FLAGC;
  }
}

static void DIV(uint16_t instr) {
  uint8_t d = instr & 077;
  uint8_t s = (instr & 07700) >> 6;
  int32_t val1 = (R[s & 7] << 16) | (R[(s & 7) | 1]);
  uint8_t l = 2 - (instr >> 15);
  uint16_t da = aget(d, l);
  int32_t val2 = memread16(da);
  PS &= 0xFFF0;
  if (val2 == 0) {
    PS |= FLAGC;
    return;
  }
  if ((val1 / val2) >= 0x10000) {
    PS |= FLAGV;
    return;
  }
  R[s & 7] = (val1 / val2) & 0xFFFF;
  R[(s & 7) | 1] = (val1 % val2) & 0xFFFF;
  setZ(R[s & 7] == 0);
  if (R[s & 7] & 0100000) {
    PS |= FLAGN;
  }
  if (val1 == 0) {
    PS |= FLAGV;
  }
}

static void ASH(uint16_t instr) {
  uint8_t d = instr & 077;
  uint8_t s = (instr & 07700) >> 6;
  uint16_t val1 = R[s & 7];
  uint16_t da = aget(d, 2);
  uint16_t val2 = memread16(da) & 077;
  PS &= 0xFFF0;
  int32_t sval;
  if (val2 & 040) {
    val2 = (077 ^ val2) + 1;
    if (val1 & 0100000) {
      sval = 0xFFFF ^ (0xFFFF >> val2);
      sval |= val1 >> val2;
    }
    else {
      sval = val1 >> val2;
    }
    if (val1 & (1 << (val2 - 1))) {
      PS |= FLAGC;
    }
  }
  else {
    sval = (val1 << val2) & 0xFFFF;
    if (val1 & (1 << (16 - val2))) {
      PS |= FLAGC;
    }
  }
  R[s & 7] = sval;
  setZ(sval == 0);
  if (sval & 0100000) {
    PS |= FLAGN;
  }
  if ((sval & 0100000) xor (val1 & 0100000)) {
    PS |= FLAGV;
  }
}

static void ASHC(uint16_t instr) {
  uint8_t d = instr & 077;
  uint8_t s = (instr & 07700) >> 6;
  uint16_t val1 = R[s & 7] << 16 | R[(s & 7) | 1];
  uint16_t da = aget(d, 2);
  uint16_t val2 = memread16(da) & 077;
  PS &= 0xFFF0;
  int32_t sval;
  if (val2 & 040) {
    val2 = (077 ^ val2) + 1;
    if (val1 & 0x80000000) {
      sval = 0xFFFFFFFF ^ (0xFFFFFFFF >> val2);
      sval |= val1 >> val2;
    }
    else {
      sval = val1 >> val2;
    }
    if (val1 & (1 << (val2 - 1))) {
      PS |= FLAGC;
    }
  }
  else {
    sval = (val1 << val2) & 0xFFFFFFFF;
    if (val1 & (1 << (32 - val2))) {
      PS |= FLAGC;
    }
  }
  R[s & 7] = (sval >> 16) & 0xFFFF;
  R[(s & 7) | 1] = sval & 0xFFFF;
  setZ(sval == 0);
  if (sval & 0x80000000) {
    PS |= FLAGN;
  }
  if ((sval & 0x80000000) xor (val1 & 0x80000000)) {
    PS |= FLAGV;
  }
}

static void XOR(uint16_t instr) {
  const uint8_t d = instr & 077;
  const uint8_t s = (instr & 07700) >> 6;
  const uint16_t val1 = R[s & 7];
  const uint16_t da = aget(d, 2);
  const uint16_t val2 = memread16(da);
  const uint16_t uval = val1 ^ val2;
  PS &= 0xFFF1;
  setZ(uval == 0);
  if (uval & 0x8000) {
    PS |= FLAGN;
  }
  memwrite16(da, uval);
}

static void SOB(const uint16_t instr) {
  const uint8_t s = (instr & 07700) >> 6;
  uint8_t o = instr & 0xFF;
  R[s & 7]--;
  if (R[s & 7]) {
    o &= 077;
    o <<= 1;
    R[7] -= o;
  }
}

static void CLR(uint16_t instr) {
  const uint8_t d = instr & 077;
  const uint8_t l = 2 - (instr >> 15);
  PS &= 0xFFF0;
  PS |= FLAGZ;
  const uint16_t da = aget(d, l);
  // Serial.print("CLR "); Serial.println(da, OCT);
  memwrite(da, l, 0);
}

static void COM(uint16_t instr) {
  uint8_t d = instr & 077;
  uint8_t l = 2 - (instr >> 15);
  uint16_t msb = l == 2 ? 0x8000 : 0x80;
  uint16_t max = l == 2 ? 0xFFFF : 0xff;
  uint16_t da = aget(d, l);
  uint16_t uval = memread(da, l) ^ max;
  PS &= 0xFFF0;
  PS |= FLAGC;
  if (uval & msb) {
    PS |= FLAGN;
  }
  setZ(uval == 0);
  memwrite(da, l, uval);
}

static void INC(const uint16_t instr) {
  const uint8_t d = instr & 077;
  const uint8_t l = 2 - (instr >> 15);
  const uint16_t msb = l == 2 ? 0x8000 : 0x80;
  const uint16_t max = l == 2 ? 0xFFFF : 0xff;
  const uint16_t da = aget(d, l);
  const uint16_t uval = (memread(da, l) + 1) & max;
  PS &= 0xFFF1;
  if (uval & msb) {
    PS |= FLAGN | FLAGV;
  }
  setZ(uval == 0);
  memwrite(da, l, uval);
}

static void _DEC(uint16_t instr) {
  uint8_t d = instr & 077;
  uint8_t l = 2 - (instr >> 15);
  uint16_t msb = l == 2 ? 0x8000 : 0x80;
  uint16_t max = l == 2 ? 0xFFFF : 0xff;
  uint16_t maxp = l == 2 ? 0x7FFF : 0x7f;
  uint16_t da = aget(d, l);
  uint16_t uval = (memread(da, l) - 1) & max;
  PS &= 0xFFF1;
  if (uval & msb) {
    PS |= FLAGN;
  }
  if (uval == maxp) {
    PS |= FLAGV;
  }
  setZ(uval == 0);
  memwrite(da, l, uval);
}

static void NEG(uint16_t instr) {
  uint8_t d = instr & 077;
  uint8_t l = 2 - (instr >> 15);
  uint16_t msb = l == 2 ? 0x8000 : 0x80;
  uint16_t max = l == 2 ? 0xFFFF : 0xff;
  uint16_t da = aget(d, l);
  int32_t sval = (-memread(da, l)) & max;
  PS &= 0xFFF0;
  if (sval & msb) {
    PS |= FLAGN;
  }
  if (sval == 0) {
    PS |= FLAGZ;
  }
  else {
    PS |= FLAGC;
  }
  if (sval == 0x8000) {
    PS |= FLAGV;
  }
  memwrite(da, l, sval);
}

static void _ADC(uint16_t instr) {
  uint8_t d = instr & 077;
  uint8_t l = 2 - (instr >> 15);
  uint16_t msb = l == 2 ? 0x8000 : 0x80;
  uint16_t max = l == 2 ? 0xFFFF : 0xff;
  uint16_t da = aget(d, l);
  uint16_t uval = memread(da, l);
  if (PS & FLAGC) {
    PS &= 0xFFF0;
    if ((uval + 1)&msb) {
      PS |= FLAGN;
    }
    setZ(uval == max);
    if (uval == 0077777) {
      PS |= FLAGV;
    }
    if (uval == 0177777) {
      PS |= FLAGC;
    }
    memwrite(da, l, (uval + 1)&max);
  }
  else {
    PS &= 0xFFF0;
    if (uval & msb) {
      PS |= FLAGN;
    }
    setZ(uval == 0);
  }
}

static void SBC(uint16_t instr) {
  uint8_t d = instr & 077;
  uint8_t l = 2 - (instr >> 15);
  uint16_t msb = l == 2 ? 0x8000 : 0x80;
  uint16_t max = l == 2 ? 0xFFFF : 0xff;
  uint16_t da = aget(d, l);
  int32_t sval = memread(da, l);
  if (PS & FLAGC) {
    PS &= 0xFFF0;
    if ((sval - 1)&msb) {
      PS |= FLAGN;
    }
    setZ(sval == 1);
    if (sval) {
      PS |= FLAGC;
    }
    if (sval == 0100000) {
      PS |= FLAGV;
    }
    memwrite(da, l, (sval - 1)&max);
  }
  else {
    PS &= 0xFFF0;
    if (sval & msb) {
      PS |= FLAGN;
    }
    setZ(sval == 0);
    if (sval == 0100000) {
      PS |= FLAGV;
    }
    PS |= FLAGC;
  }
}

static void TST(uint16_t instr) {
  uint8_t d = instr & 077;
  uint8_t l = 2 - (instr >> 15);
  uint16_t msb = l == 2 ? 0x8000 : 0x80;
  uint16_t uval = memread(aget(d, l), l);
  PS &= 0xFFF0;
  if (uval & msb) {
    PS |= FLAGN;
  }
  setZ(uval == 0);
}

