davecheney/avr11/cpu.cpp
static void ROR(uint16_t instr) {
  uint8_t d = instr & 077;
  uint8_t l = 2 - (instr >> 15);
  int32_t max = l == 2 ? 0xFFFF : 0xff;
  uint16_t da = aget(d, l);
  int32_t sval = memread(da, l);
  if (PS & FLAGC) {
    sval |= max + 1;
  }
  PS &= 0xFFF0;
  if (sval & 1) {
    PS |= FLAGC;
  }
  // watch out for integer wrap around
  if (sval & (max + 1)) {
    PS |= FLAGN;
  }
  setZ(!(sval & max));
  if ((sval & 1) xor (sval & (max + 1))) {
    PS |= FLAGV;
  }
  sval >>= 1;
  memwrite(da, l, sval);
}

static void ROL(uint16_t instr) {
  uint8_t d = instr & 077;
  uint8_t l = 2 - (instr >> 15);
  uint16_t msb = l == 2 ? 0x8000 : 0x80;
  int32_t max = l == 2 ? 0xFFFF : 0xff;
  uint16_t da = aget(d, l);
  int32_t sval = memread(da, l) << 1;
  if (PS & FLAGC) {
    sval |= 1;
  }
  PS &= 0xFFF0;
  if (sval & (max + 1)) {
    PS |= FLAGC;
  }
  if (sval & msb) {
    PS |= FLAGN;
  }
  setZ(!(sval & max));
  if ((sval ^ (sval >> 1))&msb) {
    PS |= FLAGV;
  }
  sval &= max;
  memwrite(da, l, sval);
}

static void ASR(uint16_t instr) {
  uint8_t d = instr & 077;
  uint8_t l = 2 - (instr >> 15);
  uint16_t msb = l == 2 ? 0x8000 : 0x80;
  uint16_t da = aget(d, l);
  uint16_t uval = memread(da, l);
  PS &= 0xFFF0;
  if (uval & 1) {
    PS |= FLAGC;
  }
  if (uval & msb) {
    PS |= FLAGN;
  }
  if ((uval & msb) xor (uval & 1)) {
    PS |= FLAGV;
  }
  uval = (uval & msb) | (uval >> 1);
  setZ(uval == 0);
  memwrite(da, l, uval);
}

static void ASL(uint16_t instr) {
  uint8_t d = instr & 077;
  uint8_t l = 2 - (instr >> 15);
  uint16_t msb = l == 2 ? 0x8000 : 0x80;
  uint16_t max = l == 2 ? 0xFFFF : 0xff;
  uint16_t da = aget(d, l);
  // TODO(dfc) doesn't need to be an sval
  int32_t sval = memread(da, l);
  PS &= 0xFFF0;
  if (sval & msb) {
    PS |= FLAGC;
  }
  if (sval & (msb >> 1)) {
    PS |= FLAGN;
  }
  if ((sval ^ (sval << 1))&msb) {
    PS |= FLAGV;
  }
  sval = (sval << 1) & max;
  setZ(sval == 0);
  memwrite(da, l, sval);
}

static void SXT(uint16_t instr) {
  uint8_t d = instr & 077;
  uint8_t l = 2 - (instr >> 15);
  uint16_t max = l == 2 ? 0xFFFF : 0xff;
  uint16_t da = aget(d, l);
  if (PS & FLAGN) {
    memwrite(da, l, max);
  }
  else {
    PS |= FLAGZ;
    memwrite(da, l, 0);
  }
}

static void JMP(uint16_t instr) {
  uint8_t d = instr & 077;
  uint16_t uval = aget(d, 2);
  if (isReg(uval)) {
    Serial.println(F("JMP called with register dest"));
    panic();
  }
  R[7] = uval;
}

static void SWAB(uint16_t instr) {
  uint8_t d = instr & 077;
  uint8_t l = 2 - (instr >> 15);
  uint16_t da = aget(d, l);
  uint16_t uval = memread(da, l);
  uval = ((uval >> 8) | (uval << 8)) & 0xFFFF;
  PS &= 0xFFF0;
  setZ(uval & 0xFF);
  if (uval & 0x80) {
    PS |= FLAGN;
  }
  memwrite(da, l, uval);
}

static void MARK(uint16_t instr) {
  R[6] = R[7] + ((instr & 077) << 1);
  R[7] = R[5];
  R[5] = pop();
}

static void MFPI(uint16_t instr) {
  uint8_t d = instr & 077;
  uint16_t da = aget(d, 2);
  uint16_t uval;
  if (da == 0170006) {
    // val = (curuser == prevuser) ? R[6] : (prevuser ? k.USP : KSP);
    if (curuser == prevuser) {
      uval = R[6];
    }
    else {
      if (prevuser) {
        uval = USP;
      }
      else {
        uval = KSP;
      }
    }
  }
  else if (isReg(da)) {
    Serial.println(F("invalid MFPI instruction"));
    panic();
  }
  else {
    uval = unibus::read16(mmu::decode((uint16_t)da, false, prevuser));
  }
  push(uval);
  PS &= 0xFFF0;
  PS |= FLAGC;
  setZ(uval == 0);
  if (uval & 0x8000) {
    PS |= FLAGN;
  }
}

static void MTPI(uint16_t instr) {
  uint8_t d = instr & 077;
  uint16_t da = aget(d, 2);
  uint16_t uval = pop();
  if (da == 0170006) {
    if (curuser == prevuser) {
      R[6] = uval;
    }
    else {
      if (prevuser) {
        USP = uval;
      }
      else {
        KSP = uval;
      }
    }
  }
  else if (isReg(da)) {
    Serial.println(F("invalid MTPI instrution")); panic();
  }
  else {
    unibus::write16(mmu::decode((uint16_t)da, true, prevuser), uval);
  }
  PS &= 0xFFF0;
  PS |= FLAGC;
  setZ(uval == 0);
  if (uval & 0x8000) {
    PS |= FLAGN;
  }
}

static void RTS(uint16_t instr) {
  uint8_t d = instr & 077;
  R[7] = R[d & 7];
  R[d & 7] = pop();
}

static void EMTX(uint16_t instr) {
  uint16_t uval;
  if ((instr & 0177400) == 0104000) {
    uval = 030;
  }
  else if ((instr & 0177400) == 0104400) {
    uval = 034;
  }
  else if (instr == 3) {
    uval = 014;
  }
  else {
    uval = 020;
  }
  uint16_t prev = PS;
  switchmode(false);
  push(prev);
  push(R[7]);
  R[7] = unibus::read16(uval);
  PS = unibus::read16(uval + 2);
  if (prevuser) {
    PS |= (1 << 13) | (1 << 12);
  }
}

static void _RTT(uint16_t instr) {
  R[7] = pop();
  uint16_t uval = pop();
  if (curuser) {
    uval &= 047;
    uval |= PS & 0177730;
  }
  unibus::write16(0777776, uval);
}

static void RESET(uint16_t instr) {
  if (curuser) {
    return;
  }
  cons::clearterminal();
  rk11::reset();
}

void step() {
  PC = R[7];
  uint16_t instr = unibus::read16(mmu::decode(PC, false, curuser));
  R[7] += 2;

  if (PRINTSTATE) printstate();

  switch ((instr >> 12) & 007) {
    case 001: // MOV
      MOV(instr);
      return;
    case 002: // CMP
      CMP(instr);
      return;
    case 003: // BIT
      BIT(instr);
      return;
    case 004: // BIC
      BIC(instr);
      return;
    case 005: // BIS
      BIS(instr);
      return;
  }
  switch ((instr >> 12) & 017) {
    case 006: // ADD
      ADD(instr);
      return;
    case 016: // SUB
      SUB(instr);
      return;
  }
  switch ((instr >> 9) & 0177) {
    case 0004: // JSR
      JSR(instr);
      return;
    case 0070: // MUL
      MUL(instr);
      return;
    case 0071: // DIV
      DIV(instr);
      return;
    case 0072: // ASH
      ASH(instr);
      return;
    case 0073: // ASHC
      ASHC(instr);
      return;
    case 0074: // XOR
      XOR(instr);
      return;
    case 0077: // SOB
      SOB(instr);
      return;
  }
  switch ((instr >> 6) & 00777) {
    case 00050: // CLR
      CLR(instr);
      return;
    case 00051: // COM
      COM(instr);
      return;
    case 00052: // INC
      INC(instr);
      return;
    case 00053: // DEC
      _DEC(instr);
      return;
    case 00054: // NEG
      NEG(instr);
      return;
    case 00055: // ADC
      _ADC(instr);
      return;
    case 00056: // SBC
      SBC(instr);
      return;
    case 00057: // TST
      TST(instr);
      return;
    case 00060: // ROR
      ROR(instr);
      return;
    case 00061: // ROL
      ROL(instr);
      return;
    case 00062: // ASR
      ASR(instr);
      return;
    case 00063: // ASL
      ASL(instr);
      return;
    case 00067: // SXT
      SXT(instr);
      return;
  }
  switch (instr & 0177700) {
    case 0000100: // JMP
      JMP(instr);
      return;
    case 0000300: // SWAB
      SWAB(instr);
      return;
    case 0006400: // MARK
      MARK(instr);
      break;
    case 0006500: // MFPI
      MFPI(instr);
      return;
    case 0006600: // MTPI
      MTPI(instr);
      return;
  }
  if ((instr & 0177770) == 0000200) { // RTS
    RTS(instr);
    return;
  }

