davecheney/avr11/cpu.cpp
  switch (instr & 0177400) {
    case 0000400:
      branch(instr & 0xFF);
      return;
    case 0001000:
      if (!Z()) {
        branch(instr & 0xFF);
      }
      return;
    case 0001400:
      if (Z()) {
        branch(instr & 0xFF);
      }
      return;
    case 0002000:
      if (!(N() xor V())) {
        branch(instr & 0xFF);
      }
      return;
    case 0002400:
      if (N() xor V()) {
        branch(instr & 0xFF);
      }
      return;
    case 0003000:
      if ((!(N() xor V())) && (!Z())) {
        branch(instr & 0xFF);
      }
      return;
    case 0003400:
      if ((N() xor V()) || Z()) {
        branch(instr & 0xFF);
      }
      return;
    case 0100000:
      if (!N()) {
        branch(instr & 0xFF);
      }
      return;
    case 0100400:
      if (N()) {
        branch(instr & 0xFF);
      }
      return;
    case 0101000:
      if ((!C()) && (!Z())) {
        branch(instr & 0xFF);
      }
      return;
    case 0101400:
      if (C() || Z()) {
        branch(instr & 0xFF);
      }
      return;
    case 0102000:
      if (!V()) {
        branch(instr & 0xFF);
      }
      return;
    case 0102400:
      if (V()) {
        branch(instr & 0xFF);
      }
      return;
    case 0103000:
      if (!C()) {
        branch(instr & 0xFF);
      }
      return;
    case 0103400:
      if (C()) {
        branch(instr & 0xFF);
      }
      return;
  }
  if (((instr & 0177000) == 0104000) || (instr == 3) || (instr == 4)) { // EMT TRAP IOT BPT
    EMTX(instr);
    return;
  }
  if ((instr & 0177740) == 0240) { // CL?, SE?
    if (instr & 020) {
      PS |= instr & 017;
    }
    else {
      PS &= ~instr & 017;
    }
    return;
  }
  switch (instr & 7) {
    case 00: // HALT
      if (curuser) {
        break;
      }
      Serial.println(F("HALT"));
      panic();
    case 01: // WAIT
      if (curuser) {
        break;
      }
      return;
    case 02: // RTI

    case 06: // RTT
      _RTT(instr);
      return;
    case 05: // RESET
      RESET(instr);
      return;
  }
  if (instr == 0170011) { // SETD ; not needed by UNIX, but used; therefore ignored
    return;
  }
  Serial.println("invalid instruction");
  longjmp(trapbuf, INTINVAL);
}

void trapat(uint16_t vec) { // , msg string) {
  if (vec & 1) {
    Serial.println(F("Thou darst calling trapat() with an odd vector number?"));
    panic();
  }
  Serial.print(F("trap: ")); Serial.println(vec, OCT);
  //printstate();

  /*var prev uint16
   	defer func() {
   		t = recover()
   		switch t = t.(type) {
   		case trap:
   			writedebug("red stack trap!\n")
   			memory[0] = uint16(k.R[7])
   			memory[1] = prev
   			vec = 4
   			panic("fatal")
   		case nil:
   			break
   		default:
   			panic(t)
   		}
   */
  uint16_t prev = PS;
  switchmode(false);
  push(prev);
  push(R[7]);

  R[7] = unibus::read16(vec);
  PS = unibus::read16(vec + 2);
  if (prevuser) {
    PS |= (1 << 13) | (1 << 12);
  }
}

void interrupt(uint8_t vec, uint8_t pri) {
  if (vec & 1) {
    Serial.println(F("Thou darst calling interrupt() with an odd vector number?"));
    panic();
  }
  // fast path
  if (itab[0].vec == 0) {
    itab[0].vec = vec;
    itab[0].pri = pri;
    return;
  }
  uint8_t i;
  for (i = 0; i < ITABN; i++) {
    if ((itab[i].vec == 0) || (itab[i].pri < pri)) {
      break;
    }
  }
  for (; i < ITABN; i++) {
    if ((itab[i].vec == 0) || (itab[i].vec >= vec)) {
      break;
    }
  }
  if (i >= ITABN) {
    Serial.println(F("interrupt table full")); panic();
  }
  uint8_t j;
  for (j = i + 1; j < ITABN; j++) {
    itab[j] = itab[j - 1];
  }
  itab[i].vec = vec;
  itab[i].pri = pri;
}

// pop the top interrupt off the itab.
static void popirq() {
  uint8_t i;
  for (i = 0; i < ITABN - 1; i++) {
    itab[i] = itab[i + 1];
  }
  itab[ITABN - 1].vec = 0;
  itab[ITABN - 1].pri = 0;
}

void handleinterrupt() {
  uint8_t vec = itab[0].vec;
  if (DEBUG_INTER) {
    Serial.print("IRQ: "); Serial.println(vec, OCT);
  }
  uint16_t vv = setjmp(trapbuf);
  if (vv == 0) {
    uint16_t prev = PS;
    switchmode(false);
    push(prev);
    push(R[7]);
  } else {
    trapat(vv);
  }


  R[7] = unibus::read16(vec);
  PS = unibus::read16(vec + 2);
  if (prevuser) {
    PS |= (1 << 13) | (1 << 12);
  }
  popirq();
}

};
